from flask import Flask, render_template, request, redirect, url_for

app = Flask(__name__)
app.secret_key = 'cti_booking_secure_super_key'

# تنظيم الأسماء في قواميس
staff_data = {
    'electronics': ['إسماعيل فاضل', 'أنس كرسوم', 'أيمن كيفي', 'أيمن بنجر', 'جابر يماني', 'جميل الجهني', 'حاتم الردادي', 'حاتم الزهراني', 'حسن بادويل', 'حسين المكرمي', 'خالد حجازي', 'رمزي مهدي', 'سعود المطيري', 'سعود الغامدي', 'سعود خوتنلي', 'سعيد ابو عسيس', 'سلطان العتيبي', 'صالح الشهري', 'طارق الغامدي', 'ظافر الشهري', 'عبدالرحمن الغامدي', 'عبدالله غرسان', 'عواض الشهري', 'فايز الشهري', 'فهد العامودي', 'فوزي جلالة', 'محمد صباغ', 'محمد الرفاعي', 'محمد عشري', 'هيثم نايته', 'يزيد الغامدي'],
    'communications': ['أحمد البار', 'أمين مشدق', 'أيمن صائغ', 'بدر الجهني', 'رضا الجهني', 'سعيد ظافر', 'سامي قرامي', 'سعيد عبدالرحيم', 'عمر الصايغ', 'عيد الحربي', 'عيسى السقاف', 'ماجد السريحي', 'ماهر نحاس', 'محمد العلياني', 'محمد سلامي', 'منصور الحازمي', 'وليد جمعة', 'ياسر مياجي'],
    'computer': ['إبراهيم العديني', 'أحمد كليبي', 'أحمد العمري', 'أحمد رشاد', 'أحمد عنقاوي', 'أيمن العبيدي', 'بندر الثقفي', 'بندر محمد العويضي', 'ثامر عطية الغامدي', 'جمعان الزهراني', 'جميل الخليفي', 'حسن المالكي', 'حسين أحمد باداود', 'حمد الشهابي', 'حامد الشيخ', 'حامد الشمراني', 'خالد الغامدي', 'خليل آل صمع', 'سالم الزهراني', 'سلطان آل مغلف', 'سلمان الشهري', 'صالح الغامدي', 'عادل الغامدي', 'عبدالرحمن المنتشري', 'عبدالرحمن الحربي', 'عبدالله الحازمي', 'عبدالله السهيمي', 'عبدالله الشهري', 'عبدالله ناصر', 'عبدالهادي المالكي', 'عبيد الحربي', 'فايز شافعي', 'فهد السميري', 'محمد العرياني', 'محمد الشريف', 'منصور الزهراني', 'موسى المحمادي', 'وليد الغامدي', 'ياسر الحبشان'],
    'general': ['بندر العمودي', 'تركي الغامدي', 'تركي العتيبي', 'خالد السلمي', 'خالد الزهراني', 'رامي حكمي', 'سامر فطاني', 'عبدالعزيز السلمي', 'عبدالله القحطاني', 'عبدالله البشري', 'عبدالله الرفاعي', 'علي الغامدي', 'علي الشهري', 'عمر رزق الله', 'فهيد المطيري', 'فواز الحربي', 'فيصل الحارثي', 'محمد ناجي', 'منصور الشهراني', 'هشام أبو الجدايل']
}

@app.route('/')
def home():
    return render_template('index.html')

@app.route('/select_time/<entity_id>')
def select_time(entity_id):
    # تجميع القوائم حسب القسم
    if entity_id == 'computer': 
        staff_list = staff_data['computer'] + staff_data['electronics'] + staff_data['communications']
    elif entity_id == 'general': 
        staff_list = staff_data['general']
    else: 
        staff_list = ['موظف شؤون المتدربين']
        
    return render_template('select_time.html', staff_list=staff_list)

@app.route('/book', methods=['POST'])
def book():
    return "تم تسجيل الموعد بنجاح!"

@app.route('/login')
def login():
    return render_template('login.html')

if __name__ == '__main__':
    app.run()
